{
  "peft_type": "LORA",
  "auto_mapping": null,
  "base_model_name_or_path": null,
  "revision": null,
  "task_type": null,
  "inference_mode": false,
  "r": 4,
  "target_modules": "{'to_k', 'to_q', 'to_v', 'to_out.0'}",
  "lora_alpha": 4,
  "lora_dropout": 0.0,
  "fan_in_fan_out": false,
  "bias": "none",
  "use_rslora": false,
  "modules_to_save": null,
  "init_lora_weights": "gaussian",
  "layers_to_transform": null,
  "layers_pattern": null,
  "rank_pattern": {},
  "alpha_pattern": {},
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "loftq_config": {},
  "use_dora": false,
  "use_active_func": false,
  "layer_replication": null
}